---
kind: other
id: Properties.T:Autodesk.Revit.DB.Mechanical.MechanicalEquipment
source: html/748d7ed2-630b-e3b2-eb7a-7664e4c946bf.htm
---
# MechanicalEquipment Properties

Retrieves the Connector Manager from this MEPModel.